ide/xml.xdm/test/unit/src/org/netbeans/modules/xml/xdm/diff/xdu/identical2_1.xml

<?xml version="1.0"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/1999/XMLSchema" xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance" xmlns="http://xml.netbeans.org/schema/SynchronousSample">
    <SOAP-ENV:Header/>
    <SOAP-ENV:Body>
        <typeA>
            <paramA>Hello World</paramA>
        </typeA>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
