xml.xdm/test/unit/src/org/netbeans/modules/xml/xdm/diff/xdu/extrawsattr1_1.xml

<?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:syn="http://xml.netbeans.org/schema/SynchronousSample">  <soapenv:Body>    <syn:typeA>      <syn:paramA extra="1">?string?</syn:paramA>    </syn:typeA>  </soapenv:Body></soapenv:Envelope>
